from models import *


class ZooManager(object):
    def test_zoo(self):
        print('=======================================')
        print('Добро пожаловать в Мадагаскар!')
        print('=======================================')
        g = Giraffe('Мелман', 20, 'коричневый с пятнышками', 8)
        print(g)
        g.set_aviary(int(input('Введите номер вольера -> ')))
        print('=======================================')

        z = Zebra('Марти', 19, 'с белыми и черными полосочками', 18)
        print(z)
        z.set_aviary(int(input('Введите номер вольера -> ')))
        print('=======================================')

        l = Lion('Алекс', 21, 'ярко коричневый', 2)
        print(l)
        l.set_aviary(int(input('Введите номер вольера -> ')))
        print('=======================================')

        s = SmallLion('Симба', 2, 3, 'ряв', 'молоко')
        print(s)
        s.set_aviary(int(input('Введите номер вольера -> ')))
        s.set_diet(str(input('Введите новую диету-> ')))
        print('=======================================')

        b = WildLion('Муфаса', 30, 8, 'Раааар', 'мясо')
        print(b)
        b.set_aviary(int(input('Введите номер вольера -> ')))
        b.set_diet(str(input('Введите новую диету-> ')))
